
import { Question } from "./classQuestion.js";

export let questions = new Array();
questions[0] = new Question("А голос у него был не такой, как у почтальона Печкина, дохленький. \
    У Гаврюши голосище был, как у электрички. Он _____ _____ на ноги поднимал.", 
    ["Полдеревни, зараз", "Пол деревни, за раз", "Пол-деревни, за раз"], "Правильно! Раздельно существительное будет писаться в случае наличия \
    дополнительного слова между существительным и частицей. Правильный ответ: полдеревни пишется слитно. \
    Зараз (ударение на второй слог) — это обстоятельственное наречие, пишется слитно. Означает быстро, одним махом.");

questions[1] = new Question("А эти слова как пишутся?", ["Капучино и эспрессо", "Капуччино и эспрессо", "Каппуччино и экспресо"], 
    "Конечно! По орфографическим нормам русского языка единственно верным написанием будут «капучино» и «эспрессо».");

questions[2] = new Question("Как нужно писать?", ["Чересчур", "Черезчур", "Черес-чур"],
    "Да! Это слово появилось от соединения предлога «через» и древнего слова «чур», которое означает «граница», «край». \
    Но слово претерпело изменения, так что правильное написание учим наизусть — «чересчур».");

questions[3] = new Question("Где допущена ошибка?", ["Эпелепсия", "Аккордеон", "Белиберда"], "Верно! Это слово пишется так: «эпИлепсия».");

    





